import streamlit as st
import datetime
import random

# ให้เธอคนเดียวเลยเปรียวเปรี้ยว
her_name = "Preaw"

# ข้อความก็ให้เธอ
love_messages = [
    # "เธอรู้มั้ย? เธอคือเหตุผลที่เรายิ้มทุกวัน 😊",
    # "อรุณสวัสดิ์ยามเช้างับผม 💻❤️",
    # "1.มอนิ่งยามเช้านะครับ",
    # "2.ขอให้เราอธิบาย เธอจะโกรธจะเกลียดเราก็ได้นะแต่เราก็ยังอยากเป็นแฟนกับเธออยู่ดี",
    # "3.และย้ำอีกครั้งเราไม่ได้ชอบน้องนั่นแล้วเรารักแต่เธอครับ",
    # "4.ถึงเราบอกไปแล้วว่ารักเธอแต่เธอก็ยังเอาแต่ปฏิเสธเราอยู่ดี",
    # "5.เราเลยไม่มั่นใจในสถานะของพวกเราเราเลยยังไม่พร้อมให้เธอดู",
    # "6.และไม่ต้องห่วงเธอคือ 1 เดียวในใจของเราตอนนี้ครับ",
    # "7.แต่ที่เราบอกว่าเธอไม่น่ารักอะเพราะ เรารู้สึกกดดันเราตอนเรายังไม่พร้อมมันทำให้เรารู้สึกว่าไม่น่าบอกเรื่องนี้กับเธอเลยบวกกับเธอบล็อคเราอีกทั้งที่เราขอให้เธอไม่บล็อคเรา",
    "https://www.youtube.com/watch?v=MFnKm6aB938",
    # "เธออย่าใจร้ายกับเราได้มั้ยครับ",
    # "ขอจุ๊บเยอะๆๆๆๆได้มั้ยครับ",
    # "เปรียวเปรี้ยวไม่ต้องไปทำหรอกมันเจ็บเราชอบที่รักแบบนี้นี่แหละ",
    # "คนน่ารักของเรางับรักเธอนะงับ💕",
    # "วันไหนที่เธอเหนื่อยงอแงกับเราได้นะครับที่รัก😊"
    # "คนน่ารักครับรักนะครับ",
    # "ครั้งหน้าอย่านอนดึกนะครับ",
    # "คาถาได้ผลมั้ยครับ❤️",
    "อยากเจอที่รักอีกจังงับ ม๊วฟ",
    "อยากให้ที่รักมาอยู่กับราด้วย",
    "ครอฟเฟิลกินเยอะๆนะงับ",
    "อยากกกเจอออออยากกอยู่ด้วยยยยย",
    # "อย่าทำงานหักโหมนะครับวันนี้เราตื่นมาปลุกที่รักไม่ทัน😢",
    # "เพี้ยงๆๆ สาธุ เอเมน วันนี้เจ้านายไม่ด่าแล้วครับ",
    # "อย่าลืมเรานะครับ",
    # "เราจะทำให้ที่รักแน่ใจในเรื่องนี้ให้ได้ครับ",
    # "พรุ่งนี้มีอะไรพิเศษจะให้งับ",
    # "เราอยากเจอเธอมากๆเลยครับ คิดถึงงงง😙",
    # "เปรียวเปรี้ยวไม่ต้องกังลวลเลยนะครับเพราะเรายอมให้แค่เธอเท่านั้นครับ",
    # "เธอจะตื่นสายไม่ได้นะครับที่รักเดี๋ยวครั้งหน้าเราจะไปจุ๊บเจอถึงที่เลยนะ😄",
    # "ให้ดอกไม้เปรียวเปรี้ยวนะครับอยู่กับไตไต๋ไปนานๆเลยนะครับ💐",
    # "ที่รักไม่คิดถึงเราบ้างเหรอ",
    # "เธอไม่เคยรักเราเลยเหรอ🥲",
    # "เราโทรหาเธอทุกเช้าเลยนะรู้มั้ย😢",
    # "นอนหลับสบายมั้ยครับ",
    # "อยากให้รู้ไม่มีใครสุ้เธอได้แล้วตอนนี้",
    # "เรารักเธอที่สุดในโลกแล้วครับ",
    # "เมื่อคืนนอนกี่โมงครับ",
    # "ตื่นรึยังครับ",
    # "ที่รักน่ารักสำหรับเราที่สุดนะครับ รักเธอนะ เรื่องนี้ไม่เปลี่ยนแปลงครับ😊",
    # "8.เห้อออเธอทำให้เรารู้ว่าเธอเป็นคนที่ชอบเอาแต่ใจ มีคำตอบในใจอยู่แล้วและไม่คิดจะฟังใครเลย",
    # "คิดถึงว่าที่แฟนนะ😉",
    # "แฟนครับนอนกี่โมงเอ่ยย🤟",
    # "มอนิ่งนะครับ",
    # "ดูดวงแล้วเราจะแพ้หมอดูมั้ยนะ?",
    # "ไปกินข้าวกับเราบ่อยๆนะครับที่รัก🫠",
    # "คิดถึงเธอนะครับเปรียวเปรี้ยว",
    # "นอนหลับสบายมั้ยครับเมื่อคืนคิดถึงเรามั้ย?",
    # "รับรักเราได้มั้ยครับ🤟💐",
    # "พรุ่งนี้อย่าลืมบอกพี่ที่รักว่าจะมาอยู่กับเรานะ😗",
    # "ไปกินชาบูกับเรานะที่รัก",
    # "ตื่นสายนะครับเธอเนี่ย😂",
    # "ไปหาที่รักได้มั้ยงับ😀",
    # "รักเธอนะคนน่ารักของเรา",
    # "ดู Premium สนุกมั้ยครับ",
    # "อย่าลืมอาบน้ำนะครับวันนี้",
    # "อย่าหักโหมนะครับวันนี้ตื่นมาทำแต่เช้าแล้วพักผ่อนเยอะๆครับ",
    # "คิดถึงที่รักนะ",
    # "นอนเยอะๆนะครับ🌹",
    # "วันนี้สู้ๆนะงับเธอเก่งมาก",
    # "วันนี้ WFH วันแรกตั้งใจทำงานนะงับ",
    # "กินอะไรเล่าเธอถึงได้งามแสนงาม",
    # "ว่าจะปลุก 8 โมงแต่เธอตื่นก่อนเราอีก😂",
    # "รักนะครับ",
    # "เราหลงรักที่รักมากๆแล้วกลับลำไม่ทันแล้วว💐",
    # "อยากกอดเธอนะจะจุ๊บให้ด้วย🫣",
    # "พักผ่อนเยอะๆครับเป็นห่วงนะ",
    # "gxHocaodyo,yhp 😗",
    # "คิดถึงคนขี้งอนนะ",
    # "เธอคือคนเดียวและคนแรกที่เราอยากอยู่ด้วยตั้งแต่มากทม.☺️",
    # "ขอแค่ Preaw คืนดี เรายอมเธอทุกอย่างเลย ☺️",
    # "คืนดีกันนะครับ 🤟",
    # "แคร์คุณ Preaw นะครับ 🙂",
    # "ฝันดีนะ 😪",
    # "ชอบนะครับ",
    # "คิดถึงนะครับคนน่ารัก",
    # "ไปกินข้าวกันนะขอจอง 2 วันเลย",
    # "นอนหลับสบายมั้ยครับ😊",
    # "อยากเจอเธอแล้วเนี่ย",
    # "ที่รักครับ💕",
    # "แฟนเราตื่นยังนะ",
    # "ถ้าเธอให้เราไปหาอีกเราไปจริงนะครับ😏",
    # "เปรียวเปรี้ยวคนน่ารักของเรา 🌹",
    # "ให้ครับ 💐",
    # "คิดถึงนะคนน่ารักของเรา",
    # "วันนี้สู้ๆครับ",
    # "เราชอบเธอนะครับ",
    # "วันนี้คิดถึงเธออย่างเดียวเลยครับ",
    # "อยากจุ๊บเธออะครับ😂",
    # "มาอยู่กับเรามั้ยครับ💐",
    # "จีบนะครับ ถ้าไม่เดี๋ยวเราจีบใหม่",
    # "สวัสดีครับแฟนในอนาคต"
]

# หน้าเว็บ
st.title("🌹 คิดถึงงงง " + her_name)
st.write("วันนี้ทีรักคงเหนื่อยน่าดูครับเราจะกอดให้ที่รักหายเหนื่อยเองครับ😊")
# st.write("เมื่อวานเรารักเธอ วันนี้ก็รักเธอกว่าเมื่อวาน พรุ่งนี้รักเธอมากกว่าวันนี้")

# แสดงวันที่
today = datetime.date.today()
st.write(f"📅 วันที่: {today.strftime('%d %B %Y')}")

# ข้อความสุ่ม
st.markdown("### ข้อความจากใจของไตไต๋ 💌")
st.success(random.choice(love_messages))

# ปุ่มเพิ่มความน่ารัก
if st.button("กดตรงนี้ 🪄"):
    st.snow()
    # st.write("กลับมาคุยกันได้มั้ยครับ 😊")
    # st.write("คิดถึงเบบี๋นะครับ😀")
    st.write("มีแต่คนน่ารักที่กดปุ่มนี้ได้ครับ😀")

# ลายเซ็น
st.markdown("---")
st.caption("สร้างด้วยใจและ Python โดยคนที่ตกหลุมรักเปรียวเปรี้ยวทุกวัน 💻💘")
