import streamlit as st
import datetime
import random

# ให้เธอคนเดียวเลยเปรียวเปรี้ยว
her_name = "Preaw"

# ข้อความก็ให้เธอ
love_messages = [
    # "เธอรู้มั้ย? เธอคือเหตุผลที่เรายิ้มทุกวัน 😊",
    "อรุณสวัสดิ์ยามเช้างับผม 💻❤️",
    # "วันนี้น่ารักอีกแล้วนะครับ",
    # "คิดถึงว่าที่แฟนนะ😉",
    # "แฟนครับนอนกี่โมงเอ่ยย🤟",
    # "มอนิ่งนะครับ",
    # "ดูดวงแล้วเราจะแพ้หมอดูมั้ยนะ?",
    # "ไปกินข้าวกับเราบ่อยๆนะครับที่รัก🫠",
    # "คิดถึงเธอนะครับเปรียวเปรี้ยว",
    # "นอนหลับสบายมั้ยครับเมื่อคืนคิดถึงเรามั้ย?",
    # "รับรักเราได้มั้ยครับ🤟💐",
    # "พรุ่งนี้อย่าลืมบอกพี่ที่รักว่าจะมาอยู่กับเรานะ😗",
    # "ไปกินชาบูกับเรานะที่รัก",
    # "ตื่นสายนะครับเธอเนี่ย😂",
    # "ไปหาที่รักได้มั้ยงับ😀",
    # "รักเธอนะคนน่ารักของเรา",
    "ดู Premium สนุกมั้ยครับ",
    "อย่าลืมอาบน้ำนะครับวันนี้",
    "อย่าหักโหมนะครับวันนี้ตื่นมาทำแต่เช้าแล้วพักผ่อนเยอะๆครับ",
    "คิดถึงที่รักนะ",
    "นอนเยอะๆนะครับ🌹",
    "วันนี้สู้ๆนะงับเธอเก่งมาก",
    # "วันนี้ WFH วันแรกตั้งใจทำงานนะงับ",
    # "กินอะไรเล่าเธอถึงได้งามแสนงาม",
    "ว่าจะปลุก 8 โมงแต่เธอตื่นก่อนเราอีก😂",
    "รักนะครับ",
    "เราหลงรักที่รักมากๆแล้วกลับลำไม่ทันแล้วว💐",
    # "อยากกอดเธอนะจะจุ๊บให้ด้วย🫣",
    # "พักผ่อนเยอะๆครับเป็นห่วงนะ",
    # "gxHocaodyo,yhp 😗",
    # "คิดถึงคนขี้งอนนะ",
    # "เธอคือคนเดียวและคนแรกที่เราอยากอยู่ด้วยตั้งแต่มากทม.☺️",
    # "ขอแค่ Preaw คืนดี เรายอมเธอทุกอย่างเลย ☺️",
    # "คืนดีกันนะครับ 🤟",
    # "แคร์คุณ Preaw นะครับ 🙂",
    # "ฝันดีนะ 😪",
    # "ชอบนะครับ",
    # "คิดถึงนะครับคนน่ารัก",
    # "ไปกินข้าวกันนะขอจอง 2 วันเลย",
    # "นอนหลับสบายมั้ยครับ😊",
    # "อยากเจอเธอแล้วเนี่ย",
    # "ที่รักครับ💕",
    # "แฟนเราตื่นยังนะ",
    # "ถ้าเธอให้เราไปหาอีกเราไปจริงนะครับ😏",
    # "เปรียวเปรี้ยวคนน่ารักของเรา 🌹",
    # "ให้ครับ 💐",
    # "คิดถึงนะคนน่ารักของเรา",
    # "วันนี้สู้ๆครับ",
    # "เราชอบเธอนะครับ",
    # "วันนี้คิดถึงเธออย่างเดียวเลยครับ",
    # "อยากจุ๊บเธออะครับ😂",
    "มาอยู่กับเรามั้ยครับ💐",
    # "จีบนะครับ ถ้าไม่เดี๋ยวเราจีบใหม่",
    # "สวัสดีครับแฟนในอนาคต"
]

# หน้าเว็บ
st.title("🌹 รักเธอนะ " + her_name)
st.write("เมื่อวานเรารักเธอ วันนี้ก็รักเธอกว่าเมื่อวาน พรุ่งนี้รักเธอมากกว่าวันนี้")

# แสดงวันที่
today = datetime.date.today()
st.write(f"📅 วันที่: {today.strftime('%d %B %Y')}")

# ข้อความสุ่ม
st.markdown("### ข้อความจากใจของไตไต๋ 💌")
st.success(random.choice(love_messages))

# ปุ่มเพิ่มความน่ารัก
if st.button("กดตรงนี้ 🪄"):
    st.balloons()
    # st.write("กลับมาคุยกันได้มั้ยครับ 😊")
    st.write("รักนะครับเบบี๋ของเรา😛")

# ลายเซ็น
st.markdown("---")
st.caption("สร้างด้วยใจและ Python โดยคนที่ตกหลุมรักเปรียวเปรี้ยวทุกวัน 💻💘")
