import streamlit as st
import datetime
import random

# ชื่อ
her_name = "เปรียวเปรี้ยว 💖"

# ข้อความรัก
love_messages = [
    # "ไหนว่าจะไม่บล็อกกันไงอะไรของเธอเนี่ย",
    "บล็อคเราเหรอครับบ",
    "ได้ดูหนังมั้ยย",
    # "นอนหลับสบายมั้ยครับเมื่อคืนฝนตกด้วยช่วงนี้ห่มผ้าห่มด้วยนะเดี๋ยวเป็นหวัด",
    # "อย่าลืมกินข้าวนะครับ 💕 เพราะเรารักเธอมากจนอยากให้เธอแข็งแรงอยู่เสมองับ",
    # "รักเธอนะครับ มากกว่าดวงจันทร์ 🌙 และดวงดาวทุกดวงบนฟ้า ⭐️",
    # "นอนได้แล้วนะครับ ฝันดี ฝันถึงเราด้วยนะ 💭💘",
    # "อยากเจอเธอจังเลยครับ 😚 ถ้าเจอจะกอดแน่นๆเลย",
    "งอลเราเหรองับบ",
    # "อย่าลืมกินข้าวก่อนไปออกนะเดี๋ยวไม่มีแรง",
    # "ไม่มาหาเราเหรอครับ",
    # "อย่าลืมห่มผ้านอนนะวันนี้ฝนตกอากาศจะเย็นช่วงดึกๆครับ",
    # "วันนี้วันเงินออกแต่ไม่รู้จะเหลือใช้ทั้งเดือนมั้ยนะ555",
    # "เธอเป็นความสุขเล็กๆ ที่แสนยิ่งใหญ่ของเราเลยนะ 🥹",
    # "จีบเธอทุกวันได้มั้ยครับ😘",
    # "รักนะครับ คนเดียวในใจเราตอนนี้ก็คือเธอ 💐",
    # "วันนี้เราทำงานแต่ทักมาได้ตลอดนะงับ",
    #######################
    # "เรายังอยากคุยกับเธอนะแต่เราก็ทำใจเป็นเพื่อนกับเธอไม่ได้หรอก",
    # "เห้อออเรา",
    # "ไม่อยากเป็นคนดีนะครับ อยากเป็นคนของเธอมากกว่า",
    # "เราไม่รู้ว่าเธอรู้มั้ยนะ... แต่ก่อนเราเคยรักเธอเพิ่มขึ้นเรื่อยๆ เลยนะ",
    # "เธอเป็นเหมือนกาแฟเลย เราเคยติดเธอหนักมาก เพราะใจมันสั่นทุกครั้งที่เห็นเธอดลยแหละ",
    # "เรานี่มันแย่จังนะทำให้คนที่เรารักไม่รักเราและ",
    # "ขอโทษนะที่เราไปหาเธอถึงที่ทำให้เธอรู้สึกไม่ดี แหะๆๆ",
    "นอนกี่โมงครับเมื่อคืน",
    # "เราไม่รู้ว่าเธอจะรู้มั้ยแต่เรารักเธอเพิ่มขึ้นเรื่อยๆทุกวันเลยนะแต่ช่วงนี้เรากังวลมันกลับเพิ่มจนเยอะเกินไป😂😂😂😂",
    # "เพลงนี้ให้ที่รักครับ",
    "https://www.youtube.com/watch?v=bLz7cX6uQ28&list=RDbLz7cX6uQ28&start_radio=1"
]

# แสดงหน้าเว็บ
st.set_page_config(page_title="💘 Love Letter to Preaw", page_icon="💌")
st.markdown(
    f"<h1 style='text-align: center; color: pink;'>🌹 คิดถึงเรามั้ยครับ {her_name} AKA คนน่ารัก🌹</h1>",
    unsafe_allow_html=True
)

st.markdown(
    "<h3 style='text-align: center;'>💕💕💕</h3>",
    unsafe_allow_html=True
)

# วันที่
today = datetime.date.today()
st.markdown(
    f"<p style='text-align: center; font-size: 18px;'>📅 วันนี้: <b>{today.strftime('%d %B %Y')}</b></p>",
    unsafe_allow_html=True
)

# ข้อความรักจากใจ
st.markdown("---")
st.markdown("### 💌 ข้อความจากใจของไตไต๋:")
st.success(random.choice(love_messages))

# ปุ่มวิเศษ
if st.button("💖 คลิกตรงนี้นะครับเปรียวเปรี้ยว 💖"):
    st.balloons()
    st.markdown("### 💕 ถึงยังไงเธอก็คือที่รักของเราทุกวันเลยนะครับ 💕")
    st.image("preaw_preaw.gif", caption="รักเธอนะครับคนน่ารักของเรา")
# ลายเซ็น
st.markdown("---")
st.caption("🌹")
